import { Component } from '@angular/core';

@Component({
  selector: 'app-content',
  templateUrl: './content.component.html',
  styleUrls: ['./content.component.css']
})
export class ContentComponent {

  service: any = [
    {
      text: "॥ श्री महालक्ष्म्यष्टकम् ॥", decsription: [
        "नमस्तेस्तू महामाये श्रीपिठे सूरपुजिते । शंख चक्र गदा हस्ते महालक्ष्मी नमोस्तूते ॥ १ ॥",
        "नमस्ते गरूडारूढे कोलासूर भयंकरी । सर्व पाप हरे देवी महालक्ष्मी नमोस्तूते ॥ २ ॥",
        "सर्वज्ञे सर्ववरदे सर्वदुष्ट भयंकरी । सर्व दुःख हरे देवी महालक्ष्मी नमोस्तूते ॥३ ॥",
        "सिद्धीबुद्धूीप्रदे देवी भुक्तिमुक्ति प्रदायिनी । मंत्रमूर्ते सदा देवी महालक्ष्मी नमोस्तूते ॥ ४ ॥"
      ]
    },
    {
      text: "॥ श्री महालक्ष्म्यष्टकम् ॥", decsription: [
        "आद्यंतरहिते देवी आद्यशक्ती महेश्वरी । योगजे योगसंभूते महालक्ष्मी नमोस्तूते ॥ ५ ॥",
        "स्थूल सूक्ष्म महारौद्रे महाशक्ती महोदरे । महापाप हरे देवी महालक्ष्मी नमोस्तूते ॥ ६ ॥",
        "पद्मासनस्थिते देवी परब्रम्हस्वरूपिणी । परमेशि जगन्मातर्र महालक्ष्मी नमोस्तूते ॥ ७ ॥",
        "श्वेतांबरधरे देवी नानालंकार भूषिते । जगत्स्थिते जगन्मार्त महालक्ष्मी नमोस्तूते ॥ ८ ॥"
      ]
    },
  ]
}
